export const skillsData = [
  {
    title: "Опыт работы Март 2023 — Май 2024",
    content: `
 💼 Опыт работы 💼
 Программист-разработчик, системный администратор  
 Март 2023 — Май 2024

 ---
- Разработка и внедрение решений на базе React, Node.js, MongoDB, Docker.

- Развертывание приложений в контейнерах Docker (React, MongoDB, Nginx).

- Настройка внутренней корпоративной сети и удаленного доступа через OpenVPN.

- Создание защищенного удаленного доступа к ресурсам компании из-за границы (включая Китай).

- Разграничение прав доступа по подсетям и пользователям.

- Логирование и мониторинг активности пользователей в OpenVPN.

- Восстановление старого оборудования и организация серверной комнаты.

- Настройка шлюза на OpenWRT для обеспечения безопасного доступа к MySQL серверу Windows Server 2019.

- Конфигурация IIS для доступа к 1С через браузер.

- Развертывание терминального сервера на Windows Server 2019.

- Поддержка парка ПК, установка программного обеспечения, переустановка ОС.

- Обслуживание и настройка сетевого оборудования (роутеры, свичи).

- Настройка и поддержка систем видеонаблюдения (Hikvision, Dahua, Xiaomi Smart Camera).

- Внедрение корпоративного хостинга на BrianyCP.

- Настройка почтового сервера, облачного хранилища Nextcloud.

- Борьба со спамом, создание регулярных выражений для Fail2Ban.

- Генерация SSL-сертификатов Let’s Encrypt.

- Администрирование 1С:УНФ (ввод начальных остатков, номенклатуры, контроль отчетности, инструктаж сотрудников).

---
  `,
  },
  {
    title: "Опыт работы Ноябрь 2022 — Март 2023",
    content: `
    💼 Опыт работы 💼
  SAG  
  (разработка решения)
Ноябрь 2022 — Март 2023

---
- Разработка веб-приложения для отслеживания состояния операторов ткацких станков.

- Использование библиотеки React, базы данных MongoDB.

- Запуск приложения в Docker-контейнерах (React, MongoDB, Nginx).

- Настройка внутренней сети контейнеров для обмена данными.

- Передача исходного кода заказчику после завершения проекта.

---
`,
  },
  {
    title: "Опыт работы Март 2023 — по н.в.",
    content: `
    💼 Опыт работы 💼
Системный администратор
 (специалист по информационным технологиям)  
 Москва  

 ---
- Организация и поддержка IT-инфраструктуры компании.

- Миграция серверной инфраструктуры с Windows Server 2012 на облачную платформу Windows Server 2019.

- Внедрение защищенной корпоративной сети между филиалами и облачным сервером.

- Реализация безопасного удаленного доступа к базам 1С через RDP.

- Настройка рабочих мест бухгалтерии, RuToken, терминалов.

- Переустановка ОС, диагностика и ремонт техники.

---
    `,
  },
  {
    title: "Образование",
    content: `
 📚 Образование 📚

 Профессиональная переподготовка  
ГБОУ ДПО ЦЕНТР “ПРОФЕССИОНАЛ”, Москва  
Сентябрь 2019 — Ноябрь 2022

- Fullstack-программирование  

- Разработка web-приложений (HTML, CSS, JS, PHP, MySQL) 

- Основы программирования в 1С:Предприятие 8.3  

- Разработка мобильных приложений в 1С:Предприятие 8.3 

    `,
  },
  {
    title: "Технические навыки",
    content: `
 🛠 Технические навыки 🛠

Операционные системы:
Windows (Server 2019, 10/11), Linux (Ubuntu, Debian, CentOS), FreeBSD, OpenWRT

Сетевые технологии:
TCP/IP, DHCP, DNS, NAT, VLAN, SSH, RDP, OpenVPN, OSPF, BGP (базовое понимание)

Серверное ПО:
Nginx, Apache, IIS, MySQL, PostgreSQL, MongoDB, Redis, Fail2Ban, BIND9, pfSense, FreeNAS, BrianyCP, NextCloud

Программирование / Scripting:
Python, JavaScript (React, Vue.js, React Native), Node.js, PHP, Flask, Bash, HTML5, CSS3, Bootstrap

CMS / Фреймворки:
WordPress, Drupal, Joomla, vBulletin, 1С:Предприятие

Виртуализация / Контейнеризация:
Docker, VMware ESXi, VirtualBox

Active Directory:
Настройка доменных служб Active Directory (AD DS) для управления учетными записями пользователей и групповых политик (GPO).
Создание и управление организационными единицами (OU), делегирование прав доступа.
Интеграция AD с другими сервисами (например, почтовыми серверами и файловыми хранилищами).

Samba:
Настройка файловых серверов Samba для совместного использования ресурсов между Windows и Linux.
Конфигурация прав доступа для разных групп пользователей.
Оптимизация производительности и безопасности Samba-серверов.

FTP/SFTP:
Развертывание и настройка FTP-серверов для передачи файлов внутри компании.
Настройка SFTP для безопасного обмена данными через SSH.
Ограничение доступа к FTP-ресурсам с использованием IP-адресов и сертификатов.

SSH:
Настройка SSH-подключений для безопасного администрирования серверов.
Использование ключей SSH для аутентификации и защиты от несанкционированного доступа.
Автоматизация задач через SSH-скрипты (Bash, Python).

Другое:
Git, JSON, Git-flow, CI/CD (базовые знания), термопринтеры, системы видеонаблюдения
    `,
  },
  {
    title: "Дополнительно",
    content: `
 🔧 Дополнительно 🔧

- Опыт настройки и администрирования 1С:УНФ

- Знание принципов информационной безопасности

- Навыки сборки, ремонта и диагностики компьютеров

- Опыт работы с Android (прошивка, root, диагностика)

- Ответственность, коммуникабельность, способность к самообучению
    `,
  },
];
